tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'buo/cask-upgrade'

# Binaries
brew 'cask'
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'coreutils'
brew 'pkg-config'
brew 'bash-completion'
brew 'git'
brew 'gcc'
brew 'mc'
brew 'mas'
brew 'fzf'
brew 'tree'
brew 'htop'
brew 'wget'
brew 'nmap'
brew 'links'
brew 'trash'
brew 'geoip'
brew 'watch'
brew 'gcal'

# Development
cask 'postman'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'gitkraken'
cask 'transmit'
brew 'redis'
brew 'node'
brew 'nvm'
brew 'pyenv'
brew 'go'
cask 'java'
brew 'awscli'
cask 'session-manager-plugin'

# Tools
brew 'youtube-dl'
brew 'cowsay'
brew 'fortune'

# Fonts
cask 'font-lato'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Apps
cask 'grammarly'
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'vlc'
#cask 'keepingyouawake'
cask 'alfred'
cask 'istat-menus'
cask 'droplr'
cask 'flume'
cask 'slack'
cask 'clipy'
cask 'ubersicht'
cask 'skype'
cask 'zoom'
cask 'whatsapp'
cask 'libreoffice'

