tap 'caskroom/cask'
tap 'caskroom/cask-fonts'
tap 'caskroom/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'buo/cask-upgrade'

# Binaries
brew 'cask'
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'coreutils'
brew 'pkg-config'
brew 'bash-completion'
brew 'git'
brew 'mc'
brew 'mas'
brew 'fzf'
brew 'tree'
brew 'htop'
brew 'wget'
brew 'nmap'
brew 'links'
brew 'trash'
brew 'geoip'
brew 'watch'

# Development
cask 'postman'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'gitkraken'
cask 'transmit'
brew 'node'
brew 'go'

# Tools
brew 'youtube-dl'
brew 'cowsay'
brew 'fortune'

# Fonts
cask 'font-lato'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Apps
cask 'iterm2-nightly'
cask 'google-chrome'
cask 'firefox'
cask 'vlc-nightly'
#cask 'keepingyouawake'
cask 'droplr'
cask 'flume'
cask 'java'
cask 'slack'
cask 'microsoft-teams'
cask 'skype'
cask 'skype-for-business'
cask 'whatsapp'

