tap 'buo/cask-upgrade'
tap 'romkatv/powerlevel10k'

# Binaries
brew 'cask'
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'coreutils'
brew 'pkg-config'
brew 'bash-completion'
brew 'git'
brew 'gcc'
brew 'make'
brew 'mc'
brew 'mas'
brew 'fzf'
brew 'tree'
brew 'htop'
brew 'wget'
brew 'nmap'
brew 'links'
brew 'trash'
brew 'watch'
brew 'gcalcli'

# Development
cask 'postman'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'cursor'
cask 'claude-code'
cask 'gitkraken'
cask 'transmit'
brew 'redis'
brew 'node'
brew 'nvm'
brew 'pyenv'
brew 'go'
brew 'openjdk'
brew 'awscli'
brew 'kubectl'
cask 'session-manager-plugin'
brew 'powerlevel10k'

# Tools
brew 'yt-dlp'
brew 'cowsay'
brew 'fortune'

# Fonts
cask 'font-lato'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-3'
cask 'font-source-serif-4'
cask 'font-fira-code'

# Apps
#cask 'grammarly'
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'vlc'
#cask 'keepingyouawake'
cask 'alfred'
cask 'istat-menus'
cask 'slack'
cask 'clipy'
cask 'ubersicht'
cask 'zoom'
cask 'whatsapp'
cask 'libreoffice'
